In [1]:
import pandas as pd

In [2]:
    s=pd.Series([1,2,3,4], index=["a","b","c","d"])
s

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
s["a"]

1

In [4]:
s2=s.reindex(["b","d","a","c","e"])
s2

b    2.0
d    4.0
a    1.0
c    3.0
e    NaN
dtype: float64

In [21]:
s3=pd.Series(["mavi","sar覺","mor"],index=[0,2,4])
s3

0    mavi
2    sar覺
4     mor
dtype: object

In [23]:
    s3.reindex(range(6),method="ffill")

0    mavi
1    mavi
2    sar覺
3    sar覺
4     mor
5     mor
dtype: object

In [26]:
import numpy as np

In [29]:
df=pd.DataFrame(np.arange(9).reshape(3,3),index=["a","c","d"],
                columns=["ali","efe","can"])
df

   ali  efe  can
a    0    1    2
c    3    4    5
d    6    7    8

In [30]:
df2=df.reindex(["d","c","b","a"])

In [31]:
df2

   ali  efe  can
d  6.0  7.0  8.0
c  3.0  4.0  5.0
b  NaN  NaN  NaN
a  0.0  1.0  2.0

In [33]:
isim=["efe","nur","ali"]
df2.reindex(columns=isim)

   efe  nur  ali
d  7.0  NaN  6.0
c  4.0  NaN  3.0
b  NaN  NaN  NaN
a  1.0  NaN  0.0

In [34]:
df2.loc[["c","d","a"]]

   ali  efe  can
c  3.0  4.0  5.0
d  6.0  7.0  8.0
a  0.0  1.0  2.0

In [36]:
s2

b    2.0
d    4.0
a    1.0
c    3.0
e    NaN
dtype: float64

In [37]:
yeni_s=s2.drop("b")
yeni_s

d    4.0
a    1.0
c    3.0
e    NaN
dtype: float64

In [38]:
s2.drop(["c","d"])

b    2.0
a    1.0
e    NaN
dtype: float64

In [39]:
df2

   ali  efe  can
d  6.0  7.0  8.0
c  3.0  4.0  5.0
b  NaN  NaN  NaN
a  0.0  1.0  2.0

In [45]:
df3=df2.drop(["a","c"])

In [46]:
df3

   ali  efe  can
d  6.0  7.0  8.0
b  NaN  NaN  NaN

In [47]:
df2

   ali  efe  can
d  6.0  7.0  8.0
c  3.0  4.0  5.0
b  NaN  NaN  NaN
a  0.0  1.0  2.0

In [49]:
df2.drop("ali",axis=1)

   efe  can
d  7.0  8.0
c  4.0  5.0
b  NaN  NaN
a  1.0  2.0

In [56]:
df3=df2.drop("b",axis=0)
df3

   ali  efe  can
d  6.0  7.0  8.0
c  3.0  4.0  5.0
a  0.0  1.0  2.0

In [57]:
df3.mean()

ali    3.0
efe    4.0
can    5.0
dtype: float64

In [62]:
df3.mean(axis="index")

ali    3.0
efe    4.0
can    5.0
dtype: float64

In [63]:
df3.mean(axis="columns")

d    7.0
c    4.0
a    1.0
dtype: float64